{
  "sections": [
    {
      "title": "Concept & Ambiance",
      "body": "SKOOL Kitchen embodies the modern evolution of Asian street food, elevating humble hawker favorites into refined dining experiences. The restaurant's playful name reflects its educational approach to introducing diners to authentic flavors while maintaining approachability. The industrial-chic interior features exposed brick, concrete floors, and colorful murals that reference Asian street markets. The open kitchen concept allows diners to witness the wok hei in action, creating an energetic atmosphere that bridges casual and upscale dining."
    },
    {
      "title": "Menu & Signature Experience",
      "body": "The menu reads like a greatest hits of Asian street food, expertly executed with premium ingredients. Signature dishes include the Char Kway Teow with its perfect balance of sweet and savory, featuring fresh prawns and Chinese sausage. The Hainanese Chicken Rice showcases silky poached chicken with fragrant rice and house-made chili sauce. Their Vietnamese Pho arrives with a deeply flavored 24-hour bone broth. The Pad Thai demonstrates textbook execution with tamarind-forward flavors. Creative cocktails incorporate Asian ingredients like pandan, lychee, and yuzu, while the dessert menu features modern takes on classics like mango sticky rice."
    },
    {
      "title": "Conclusion",
      "body": "SKOOL Kitchen succeeds in making authentic Asian street food accessible to international palates without compromising integrity. It's perfect for casual dinners, group gatherings, or anyone craving comfort food with a quality upgrade. The pricing reflects the premium ingredients and skilled execution while remaining reasonable for regular visits. This is where Canggu's diverse community comes together over shared plates and cold beers. No reservations needed for most nights, though weekend evenings can get busy. SKOOL Kitchen proves that street food can be both authentic and refined."
    }
  ]
}